{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.17.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "32"}, {"size": "32"}, {"size": "3"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/modified_alex_net/sequential/conv2d/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential/conv2d/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential/conv2d_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential/conv2d_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential/conv2d_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential/conv2d_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential/conv2d_3/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "192"}, {"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential/conv2d_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential/conv2d_4/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "192"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential/conv2d_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/modified_alex_net/global_average_pooling2d/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential_1/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "2048"}]}}}}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential_1/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential_1/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}, {"size": "2048"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential_1/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}]}}}}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential_1/dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}, {"size": "10"}]}}}}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential_1/dense_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "32"}, {"size": "32"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential/conv2d/Relu", "op": "_FusedConv2D", "input": ["input_1", "StatefulPartitionedCall/modified_alex_net/sequential/conv2d/Conv2D/ReadVariableOp", "StatefulPartitionedCall/modified_alex_net/sequential/conv2d/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"filter_format": {"s": "SFdJTw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "num_host_args": {"i": "0"}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential/max_pooling2d/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/modified_alex_net/sequential/conv2d/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential/conv2d_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/modified_alex_net/sequential/max_pooling2d/MaxPool", "StatefulPartitionedCall/modified_alex_net/sequential/conv2d_1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/modified_alex_net/sequential/conv2d_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential/max_pooling2d_1/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/modified_alex_net/sequential/conv2d_1/Relu"], "attr": {"explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential/conv2d_2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/modified_alex_net/sequential/max_pooling2d_1/MaxPool", "StatefulPartitionedCall/modified_alex_net/sequential/conv2d_2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/modified_alex_net/sequential/conv2d_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "num_host_args": {"i": "0"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "filter_format": {"s": "SFdJTw=="}, "padding": {"s": "U0FNRQ=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential/conv2d_3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/modified_alex_net/sequential/conv2d_2/Relu", "StatefulPartitionedCall/modified_alex_net/sequential/conv2d_3/Conv2D/ReadVariableOp", "StatefulPartitionedCall/modified_alex_net/sequential/conv2d_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "num_host_args": {"i": "0"}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "filter_format": {"s": "SFdJTw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential/conv2d_4/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/modified_alex_net/sequential/conv2d_3/Relu", "StatefulPartitionedCall/modified_alex_net/sequential/conv2d_4/Conv2D/ReadVariableOp", "StatefulPartitionedCall/modified_alex_net/sequential/conv2d_4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "padding": {"s": "U0FNRQ=="}, "filter_format": {"s": "SFdJTw=="}, "use_cudnn_on_gpu": {"b": true}, "num_host_args": {"i": "0"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential/max_pooling2d_2/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/modified_alex_net/sequential/conv2d_4/Relu"], "attr": {"explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/modified_alex_net/global_average_pooling2d/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/modified_alex_net/sequential/max_pooling2d_2/MaxPool", "StatefulPartitionedCall/modified_alex_net/global_average_pooling2d/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential_1/dense/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/modified_alex_net/global_average_pooling2d/Mean", "StatefulPartitionedCall/modified_alex_net/sequential_1/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/modified_alex_net/sequential_1/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential_1/dense_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/modified_alex_net/sequential_1/dense/Relu", "StatefulPartitionedCall/modified_alex_net/sequential_1/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/modified_alex_net/sequential_1/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential_1/dense_2/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/modified_alex_net/sequential_1/dense_1/Relu", "StatefulPartitionedCall/modified_alex_net/sequential_1/dense_2/MatMul/ReadVariableOp", "StatefulPartitionedCall/modified_alex_net/sequential_1/dense_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential_1/dense_2/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/modified_alex_net/sequential_1/dense_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/modified_alex_net/sequential_1/dense_2/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1645}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "StatefulPartitionedCall/modified_alex_net/sequential/conv2d/Conv2D/ReadVariableOp", "shape": [3, 3, 3, 48], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.28731322907934004, "scale": 0.0019678988293105482, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential/conv2d/BiasAdd/ReadVariableOp", "shape": [48], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07597790395512301, "scale": 0.0006331491996260251, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential/conv2d_1/Conv2D/ReadVariableOp", "shape": [3, 3, 48, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5901940920773674, "scale": 0.003987797919441672, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential/conv2d_1/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.12087875861747592, "scale": 0.0011403656473346784, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential/conv2d_2/Conv2D/ReadVariableOp", "shape": [3, 3, 128, 192], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6332702100276947, "scale": 0.004139020980573168, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential/conv2d_2/BiasAdd/ReadVariableOp", "shape": [192], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.15280364646631128, "scale": 0.0011845243912117153, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential/conv2d_3/Conv2D/ReadVariableOp", "shape": [3, 3, 192, 192], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5783824990777409, "scale": 0.004483585264168533, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential/conv2d_3/BiasAdd/ReadVariableOp", "shape": [192], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.28262832830933965, "scale": 0.001596770216436947, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential/conv2d_4/Conv2D/ReadVariableOp", "shape": [3, 3, 192, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5168514169898688, "scale": 0.0038571001267900655, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential/conv2d_4/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.20195532324267368, "scale": 0.001167371810651293, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/modified_alex_net/global_average_pooling2d/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential_1/dense/MatMul/ReadVariableOp", "shape": [128, 2048], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5164688425905565, "scale": 0.003637104525285609, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential_1/dense/BiasAdd/ReadVariableOp", "shape": [2048], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.11621428096995634, "scale": 0.000807043617846919, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential_1/dense_1/MatMul/ReadVariableOp", "shape": [2048, 2048], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.47669320901234946, "scale": 0.003638879458109538, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential_1/dense_1/BiasAdd/ReadVariableOp", "shape": [2048], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1654269607628093, "scale": 0.001312912387006423, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential_1/dense_2/MatMul/ReadVariableOp", "shape": [2048, 10], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4223215687508677, "scale": 0.0022952259171242807, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/modified_alex_net/sequential_1/dense_2/BiasAdd/ReadVariableOp", "shape": [10], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.05365873863007509, "scale": 0.0006792245396212036, "original_dtype": "float32"}}]}]}